#define  _CRT_SECURE_NO_WARNINGS
//结构体
//结构体的关键字struct
//自定义类型
//struct Student
//{
//	char name[20];
//	int age;
//	int high;
//	float weight;
//	char id[16];
//};//分号
#include<stdio.h>
//struct S
//{
//	char c;
//	int n;
//};
//
//struct B
//{
//	struct S s;
//	int* p;
//	char arr[10];
//	float sc;
//};
//int main()
//{
//	struct B b = { {'w',99},NULL,"hehe",85.5f};//结构体初始化
//	printf("%c",b.s.c);
//	return 0;
//}
//操作符的属性:优先级，结合级
//int main()
//{
//	//优先级
//	3 + 4 * 5;//23
//	//优先级相同，结合性
//	return 0;
//}
//表达式求值
//整型提升
//int main()
//{
//	char a = 3;//char -- signed char
//	//00000000000000000000000000000011
//	//00000011 - a
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111 - b
//
//	char c = a + b;//int int
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010  
//	//10000010 - c
//	//11111111111111111111111110000010 -- c提升后的结果
//	//10000000000000000000000001111101
//	//10000000000000000000000001111110 -- 原码
//	//-126
//	//计算精度提高
//	//如何进行整体提升呢?
//	printf("%d\n", c);//%d - 以十进制的形式打印有符号的整数
//	return 0;
//}
//算数转换
//问题表达式解析:1.加括号 2.拆开写
//c + --c有问题:c什么时候准备好?不确定  尽量不要同一变量
//static修饰变量，创建一次不销毁
//结论:不要写特别复杂的表达式
