#define  _CRT_SECURE_NO_WARNINGS
//操作符详解
//不同的进制是数值的不同表示形式而已
//整数的二进制形式有原码，反码，补码
//正整数的原码，反码，补码相同，但负整数的三种表示方法各不相同
//原码
#include<stdio.h>
//int main()
//{
//	int a = -10;//有符号整数
//	//-10存放在a中，a是整型变量，是4个字节，32bit位
//	//-10最高位是1
//	//10000000000000000000000000001010----原码
//	//11111111111111111111111111110101----反码(最高位保持不变，其余01转换)
//	//11111111111111111111111111110110----补码(反码加1，二进制)
//	int b = 0;
//	//00000000000000000000000000001010----原码，反码，补码
//	//主要用补码,对于整形来说:数据存放内存中其实放的是补码
//	return 0;
//}
//1-1
//1+(-1)  用原码符号位怎么办？用补码，然后最高位装不下丢掉了
//移位操作符--移动的是二进制的位
//int main()
//{
//	int a = 6;
//	int b = (a << 1);//左边抛弃，右边补零
//	printf("%d\n",b);//-12
//	printf("%d\n",a);
//	return 0;
//}
//右移
//算数右移,逻辑右移
//位操作符
//& 按(二进制)位与
//|按位或
// ^按位异或
//int main()
//{
//	int a = 3;
//	int b = -5;
//
//	int c = a & b;
//	//00000000000000000000000000000011 3的补码
//	//10000000000000000000000000000101 
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 -5的补码
//	//00000000000000000000000000000011 -补码
//	printf("%d\n",c);
//	return 0;
//}
//面试题:不能创建临时变量，实现两个整数的交换
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前:a = %d b = %d\n",a,b);
//	a = a ^ b;
//	b = a ^ b;//b = a
//	a = a ^ b;//a = b
//
//	printf("交换后:a = %d,b = %d\n",a,b);
//	return 0;
//}
//求一个整数在内存中二进制中1的个数
//int main()
//{
//	unsigned int n = 0;
//	scanf("%d",&n);
//	int count = 0;
//	while (n)
//	{
//		if(n % 2 == 1);
//		count++;
//		n /= 2; 
//	}
//	printf("%d",count);
//	return 0;
//}
//&
//int main()
//{
//	//1101
//	//00000000000000000000000000001101
//	//00000000000000000000000000000001
//	int n = 0;
//	int count = 0;
//	scanf("%d",&n);
//	int i = 0;
//	for (i = 0;i < 32;i++)
//	{
//		if (((n >> i) & 1) == 1)
//			count++;
//	}
//	printf("%d\n",count);
//	return 0;
//}
//int main()
//{
//	int n = 0;
//	int count = 0;
//	scanf("%d",&n);
//	while (n)
//	{
//		n = n & (n - 1);
//		count++;
//	}
//	printf("%d",count);
//	return 0;
//}
//二进制的位置0或位置1
//int main()
//{
//	int n = 13;
//	n |= (1 << 4);
//	printf("%d\n",n);
//	n &= (~(1<<4));
//	printf("%d\n",n);
//	return 0;
//}
//逗号表达式
